public/posts/2026-02-11-example-post.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Example Post: On Thresholds</title>
<meta name="author" content="Eduardo Apolinario" />
<meta name="description" content="An example post demonstrating the structure and philosophy of Liminal Desiderata" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/blog/static/style.css?v=1770909487" type="text/css"/>
<link rel="stylesheet" href="/blog/static/htmlize.css?v=1770909487" type="text/css"/>
<link rel="alternate" type="application/rss+xml" href="/blog/rss.xml" title="RSS feed for Liminal Desiderata">
</head>
<body>
<div id="preamble" class="status">
<div class="header">
  <div class="sitelinks">
    <a href="/blog/index.html">Home</a>
    |
    <a href="/blog/blog.html">All Posts</a>
    |
    <a href="/blog/about.html">About</a>
    |
    <a href="/blog/contact.html">Contact</a>
  </div>
</div>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Example Post: On Thresholds</h1>
</header><nav id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orge4c18f8">Introduction</a></li>
<li><a href="#org35a18c7">Writing in Org-Mode</a></li>
<li><a href="#org0be1fb8">Example Code Block</a></li>
<li><a href="#orgf039238">Lists and Structure</a></li>
<li><a href="#orgaa75fa7">Conclusion</a></li>
</ul>
</div>
</nav>
<div id="outline-container-orge4c18f8" class="outline-2">
<h2 id="orge4c18f8">Introduction</h2>
<div class="outline-text-2" id="text-orge4c18f8">
<p>
This is an example post for <i>Liminal Desiderata</i>. It demonstrates the structure of a typical essay: org-mode source files that transform into clean, semantic HTML.
</p>

<p>
The blog lives at thresholds—between what exists and what is desired but not yet realized.
</p>
</div>
</div>
<div id="outline-container-org35a18c7" class="outline-2">
<h2 id="org35a18c7">Writing in Org-Mode</h2>
<div class="outline-text-2" id="text-org35a18c7">
<p>
Posts are written in <a href="https://orgmode.org/">org-mode</a>, a powerful markup language native to Emacs. The benefits:
</p>

<ul class="org-ul">
<li><b>Plain text</b> that remains readable in any editor</li>
<li><b>Structural editing</b> with outlining and folding</li>
<li><b>Export flexibility</b> to HTML, PDF, and other formats</li>
<li><b>Literate programming</b> support for code examples</li>
</ul>

<p>
This aligns with the blog&rsquo;s philosophy: clarity over cleverness, durability over trends.
</p>
</div>
</div>
<div id="outline-container-org0be1fb8" class="outline-2">
<h2 id="org0be1fb8">Example Code Block</h2>
<div class="outline-text-2" id="text-org0be1fb8">
<p>
Here&rsquo;s a simple example in Python:
</p>

<div class="org-src-container">
<pre class="src src-python"><span class="org-keyword">def</span> <span class="org-function-name">threshold_state</span>(system):
<span class="org-indent-bars-1"> </span>   <span class="org-doc">"""Detect if a system is in a liminal state."""</span>
<span class="org-indent-bars-1"> </span>   <span class="org-keyword">if</span> <span class="org-keyword">not</span> system.has_stable_invariants():
<span class="org-indent-bars-1"> </span>   <span class="org-indent-bars-2"> </span>   <span class="org-keyword">return</span> <span class="org-string">"liminal"</span>
<span class="org-indent-bars-1"> </span>   <span class="org-keyword">return</span> <span class="org-string">"stable"</span>
</pre>
</div>

<p>
Code blocks render with syntax highlighting and minimal styling.
</p>
</div>
</div>
<div id="outline-container-orgf039238" class="outline-2">
<h2 id="orgf039238">Lists and Structure</h2>
<div class="outline-text-2" id="text-orgf039238">
<p>
Things to consider when writing:
</p>

<ol class="org-ol">
<li>Assume technical sophistication in the reader</li>
<li>Name tradeoffs explicitly rather than hiding them</li>
<li>Connect technical specifics to broader judgments</li>
<li>Avoid beginner explanations unless explicitly relevant</li>
</ol>

<p>
Bullet points for desiderata:
</p>

<ul class="org-ul">
<li>Clarity</li>
<li>Precision</li>
<li>Intellectual honesty</li>
<li>Long-term coherence</li>
</ul>
</div>
</div>
<div id="outline-container-orgaa75fa7" class="outline-2">
<h2 id="orgaa75fa7">Conclusion</h2>
<div class="outline-text-2" id="text-orgaa75fa7">
<p>
This example post demonstrates the basic structure. Real posts will explore distributed systems, abstraction, career decisions, and other topics at the intersection of technical design and human judgment.
</p>

<p>
The goal is durable thinking, not hot takes.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id="postamble" class="status">
Created by <a href="https://orgmode.org">Org Mode</a>
</div>
</div>
</body>
</html>
